-- -------------------------------------------------------------------------------
-- Copyright (c), 2017-2025, Sunchip Tech  All rights reserved.
-- -------------------------------------------------------------------------------
-- file     menu_config.lua
-- brief    ${DESCRIPTION}
-- author:   fangjianjun
-- version  v1.0
-- date     2017-03-29
menu={

-- ######################################
-- #  Function Switch
-- ######################################
switch={
          record_eis=0,
          record_sound=1,
          record_awmd=0,
          record_drivingmode=0,
          camera_imagerotation=0,
          camera_ledindicator=1,
          camera_timewatermark=1,
          camera_distortioncalibration=0,
          camera_wifi=0,
          camera_keytone=1,
          },


--- ########### record config start  #################
record={

         -- ############################
         -- # 录像分辨率
         -- #0  4K30FPS
         -- #1  2.7K30FPS
         -- #2  1080P120FPS
         -- #3  1080P60FPS
         -- #4  1080P30FPS
         -- #5  720P240FPS
         -- #6  720P120FPS
         -- #7  720P60FPS
         -- #8  720P30FPS
         -- ############################
         resolution={
         current=0,
         count=9,
         },
         
         -- ############################
         -- # 循环录影
         -- # 0     关闭
         -- # 1		2分钟
         -- # 2		3分钟
         -- # 3		5分钟
         -- ############################
         loop={
         current=0,
         count=4,
         },
         
         -- ############################
         -- # 缩时录影
         -- # 0     关闭
         -- # 1     0.5s
         -- # 2     1s
         -- # 3     2s
         -- # 4     5s
         -- # 5     10s
         -- # 6     30s
         -- # 7     60s
         -- ############################
         timelapse={
         current=0,
         count=8,
         },
         
         --  ############################
         --  # 慢摄影
         --  # 0      1080P120FPS
         --  # 1      1080P60FPS
         --  # 2      720P240FPS
         --  # 3      720P120FPS
         --  ############################
         slowmotion={
         current=1,
         count=4,
         },
         
         },
--- ########### record config end  #################


--- ########### photo config start  #################
photo={

       -- ############################
       -- # 拍照分辨率
       -- # 0		8M
       -- # 1		13M
       -- # 2		16M
       -- ############################
        resolution={
        current=0,
        count=3,
        },
        
        
       -- ############################
       -- # 定时拍照
       -- # 0    关闭
       -- # 1    3S
       -- # 2    5S
       -- # 3    10S
       -- # 4    20S
       -- ############################
        timed={
        current=0,
        count=5,
        },
        
       -- ############################
       -- # 自动拍照
       -- # 0  关闭
       -- # 1  3S
       -- # 2  10S
       -- # 3  15S
       -- # 4  20S
       -- # 5  30S
       -- ############################
        auto={
        current=0,
        count=6,
        },
        
       -- ############################
       -- # 运动轨迹拍照
       -- # 0  关闭
       -- # 1  3P/S
       -- # 2  5P/S
       -- # 3  10P/S
       -- #############################
        dramashot={
        current=0,
        count=4,
        },
       
       },

--- ########### photo config end  #################

--- ########### camera config start  ################
camera={
       
       -- ############################
       -- # 曝光
       -- # 0		-3
       -- # 1		-2
       -- # 2		-1
       -- # 3		0
       -- # 4		1
       -- # 5		2 
       -- # 6		3
       -- ############################
       exposure={
       current=3,
       count=7,
       },
       
       -- ############################
       -- # 白平衡
       -- # 0		自动
       -- # 1		晴天
       -- # 2		阴天
       -- # 3		白炽光
       -- # 4		荧光
       -- ############################
       whitebalance={
       current=0,
       count=5,
       },
       
       -- ############################
       -- # 光频设置
       -- # 0  自动
       -- # 1	50Hz
       -- # 2	60Hz
       -- ############################
       lightfreq={
       current=0,
       count=3,
       },
       
       -- ############################
       -- # 自动屏保
       -- # 0	关闭
       -- # 1	30s
       -- # 2	1分钟
       -- # 3	2分钟
       -- ############################
       autoscreensaver={
       current=0,
       count=4,
       },
       
       
       -- ############################
       -- # 延时关机
       -- # 0	关闭
       -- # 1	3分钟
       -- # 2	5分钟
       -- # 3	10分钟
       -- ############################
       timedshutdown={
       current=0,
       count=4,
       },
       
       -- ############################
       -- # wifi信息
       -- # 0  ssid	
       -- # 1	密码
       -- ############################
       wifiinfo={
       ssid="",
       password="12345678",
       },
       
      },
--- ########### camera config end  ################

--- ########### device config start  ################
device={

         -- ############################
         -- # 语言
         -- # 0		中文简体
         -- # 1		中文繁体
         -- # 2		英文
         -- # 3     日文
         -- # 4     韩文
         -- # 5     俄文
         -- # 6     德语
         -- # 7     法语
         -- # 8     意大利语
         -- # 9     西班牙语
         -- # 10    波兰语
         -- ############################
         language={
         current=0,
         count=11,
         },
         
         -- ############################
         -- # 声音音量调节
         -- # 0	    关闭
         -- # 1	    30%
         -- # 2	    50%
         -- # 3	    80%
         -- # 4	    100%
         -- ############################
         voicestatus={
         current=4,
         count=5,
         },
         
         -- ############################
         -- # 设备信息
         -- # 0	产品型号
         -- # 1	软件版本
         -- # 2	更新日期
         -- # 3  制造商
         -- ############################
         deviceinfo={
         producttype="V5",
         softwareversion="SunChip-2017",
         updated="20170426",
         manufacturer="晨芯时代",
         },
         
        },
--- ########### device config end  ################

}
