-- -------------------------------------------------------------------------------
-- Copyright (c), 2017-2025, Sunchip Tech  All rights reserved.
-- -------------------------------------------------------------------------------
-- file     menu_config.lua
-- brief    ${DESCRIPTION}
-- author:   fangjianjun
-- version  v1.0
-- date     2017-03-29
menu={

-- ######################################
-- #  Function Switch
-- ######################################
switch={
          record_eis=0,
          record_awmd=0,
          record_drivingmode=0,
          camera_imagerotation=0,
          camera_ledindicator=1,
          camera_timewatermark=1,
          camera_distortioncalibration=0,
          camera_keytone=1,
		  acc_resume = 0,
		  camB_preview = 0,
          },


--- ########### record config start  #################
record={

		-- ############################
		-- # 前摄像头录像分辨率
		-- #0  4K30FPS
		-- #1  2.7K30FPS
		-- #2  1080P30FPS
		-- ############################
         resolution={
         current=0,
         count=3,
         },
         -- ############################
         -- # 后摄像头录像分辨率
         -- #0  720P60FPS
         -- #1  720P30FPS
         -- ############################
         rear_resolution={
         current=0,
         count=2,
         },
		 -- ############################
         -- # 屏幕亮度
         -- #0  亮度等级:1
         -- #1  亮度等级:2
         -- #2  亮度等级:3
		 -- #3  亮度等级:4
         -- #4  亮度等级:5
         -- #5  亮度等级:6
         -- #6  亮度等级:7
         -- ############################
         screenbrightness={
         current=3,
         count=7,
         },
		 -- ############################
         -- # 行车记录仪录音
         -- #0  关闭
         -- #1  打开
         -- ############################
         record_sound={
         current=1,
         count=2,
         },
		  -- ############################
         -- # 屏幕免打扰模式
         -- #0  关闭
         -- #1  打开
         -- ############################
         disturbmode={
         current=0,
         count=2,
         },
		 -- ############################
         -- # ADAS开关
         -- #0  关闭
         -- #1  打开
         -- ############################
         adas={
         current=1,
         count=2,
         },
		 -- ############################
         -- # ADAS前方碰撞预警 forward collision warning
         -- #0  关闭
         -- #1  打开
         -- ############################
         adasfcw={
         current=1,
         count=2,
         },
		 -- ############################
         -- # ADAS 车道偏移提醒 lane shift reminding
         -- #0  关闭
         -- #1  打开
         -- ############################
         adaslsr={
         current=1,
         count=2,
         },
		 -- ############################
         -- # 语音拍照
         -- #0  关闭
         -- #1  打开
         -- ############################
         voicephoto={
         current=1,
         count=2,
         },
		 -- ############################
         -- # wifi 连接
         -- #0  关闭
         -- #1  打开
         -- ############################
         wifisw={
         current=0,
         count=2,
         },
		 -- ############################
         -- # 4G网络设置
         -- #0  关闭
         -- #1  打开
		 -- #2  sim 卡信息
         -- ############################
         network4g={
         current=1,
         count=3,
         },
		 -- ############################
         -- # 开机音效开关
         -- #0  关闭
         -- #1  打开
         -- ############################
         poweronvoice={
         current=1,
         count=2,
         },
		 -- ############################
         -- # 按键声音
         -- #0  关闭
         -- #1  打开
         -- ############################
         keyvoice={
         current=1,
         count=2,
         },
		 -- ############################
         -- # 驾驶报告
         -- #0  关闭
         -- #1  打开
         -- ############################
         drivereport={
         current=1,
         count=2,
         },
		 -- ############################
         -- # 电子狗开关
         -- #0  关闭
         -- #1  打开
		 -- #3  提示音量
		 -- #4  数据更新
         -- ############################
         watchdog={
         current=1,
         count=4,
         },
		 -- ############################
         -- # 提示音量选择
         -- #0  音量等级:高
         -- #1  音量等级:中
         -- #2  音量等级:低
         -- ############################
         volumeselect={
         current=1,
         count=3,
         },
		 -- ############################
         -- # 电子狗 探头提示
         -- #0  关闭
         -- #1  打开
         -- ############################
         probeprompt={
         current=1,
         count=2,
         },
		 -- ############################
         -- # 电子狗 超速提示
         -- #0  关闭
         -- #1  打开
         -- ############################
         speedprompt={
         current=0,
         count=2,
         },
		 -- ############################
         -- # 时间水印开关
         -- #0  关闭
         -- #1  打开
         -- ############################
         timewatermark={
         current=0,
         count=2,
         },
		 -- ############################
         -- # 紧急录像开关
         -- #0  关闭
         -- #1  打开
         -- ############################
		 emerrecord={
         current=0,
         count=2,
         },
		 -- ############################
         -- # 碰撞灵敏度
         -- #0  高
         -- #1  中
		 -- #2  低
         -- ############################
		 emerrecordsen={
         current=1,
         count=3,
         },
		 -- ############################
         -- # 停车监控监控
         -- #0  关闭
         -- #1  打开
         -- ############################
		 parkingmonitor={
         current=0,
         count=2,
         },
		 -- ############################
         -- # 驻车警示灯
         -- #0  关闭
         -- #1  打开
         -- ############################
		 parkingwarnlamp={
         current=1,
         count=2,
         },
		 -- ############################
         -- # 驻车异常监控
         -- #0  关闭
         -- #1  打开
         -- ############################
		 parkingabnormalmonitor={
         current=1,
         count=2,
         },
		 -- ############################
         -- # 驻车异常通知
         -- #0  关闭
         -- #1  打开
         -- ############################
		 parkingabnormalnotice={
         current=1,
         count=2,
         },
		 -- ############################
         -- # 停车循环录影开关
         -- #0  关闭
         -- #1  打开
         -- ############################
		 parkingloopsw={
         current=1,
         count=2,
         },
		 -- ############################
         -- # 停车循环录影分辨率
         -- #0  1080P 5fsp
         -- #1  720P  15fsp
		 -- #2  720P  5fsp
		 -- #3  720P  2fsp
         -- ############################
		 parkingloopresolution={
         current=0,
         count=4,
         },
         -- ############################
         -- # 主录像编码类型
         -- #0 高压缩
         -- #1 H264
         -- ############################
         encodingtype={
         current=0,
         count=2,
         },

         -- ############################
         -- # 循环录影
         -- # 0		1分钟
         -- # 1		2分钟
         -- # 2		5分钟
         -- ############################
         loop={
         current=1,
         count=3,
         },
          -- ############################
         -- # 待机时钟开关
         -- #0  关闭
         -- #1  打开
         -- ############################
		 standbyclock={
         current=1,
         count=2,
         },
         -- ############################
         -- # 缩时录影
         -- # 0     关闭
         -- # 1     0.5s
         -- # 2     1s
         -- # 3     2s
         -- # 4     5s
         -- # 5     10s
         -- # 6     30s
         -- # 7     60s
         -- ############################
         timelapse={
         current=0,
         count=8,
         },
         
         --  ############################
         --  # 慢摄影
         --  # 0      1080P120FPS
         --  # 1      1080P60FPS
         --  # 2      720P240FPS
         --  # 3      720P120FPS
         --  ############################
         slowmotion={
         current=1,
         count=4,
         },
		 
	 -- ############################
         -- # 降压线模式
         -- #0  ACC 降压线供电
         -- #1  车载点烟器供电
         -- ############################
         acc={
         current=1,
         count=2,         
         },
	},
--- ########### record config end  #################


--- ########### photo config start  #################
photo={

       -- ############################
       -- # 拍照分辨率
       -- # 0		8M
       -- # 1		13M
       -- # 2		16M
       -- ############################
        resolution={
        current=1,
        count=3,
        },
        
        
       -- ############################
       -- # 定时拍照
       -- # 0    关闭
       -- # 1    3S
       -- # 2    5S
       -- # 3    10S
       -- # 4    20S
       -- ############################
        timed={
        current=0,
        count=5,
        },
        
       -- ############################
       -- # 自动拍照
       -- # 0  关闭
       -- # 1  3S
       -- # 2  10S
       -- # 3  15S
       -- # 4  20S
       -- # 5  30S
       -- ############################
        auto={
        current=0,
        count=6,
        },
        
       -- ############################
       -- # 运动轨迹拍照
       -- # 0  关闭
       -- # 1  3P/S
       -- # 2  5P/S
       -- # 3  10P/S
       -- #############################
        dramashot={
        current=0,
        count=4,
        },
       -- ############################
       -- # 拍照质量
       -- # 0  优质
       -- # 1  标准
       -- # 2  经济
       -- #############################
        quality={
        current=0,
        count=3,
        },  
       
       },

--- ########### photo config end  #################

--- ########### camera config start  ################
camera={
       
       -- ############################
       -- # 曝光
       -- # 0		-3
       -- # 1		-2
       -- # 2		-1
       -- # 3		0
       -- # 4		1
       -- # 5		2 
       -- # 6		3
       -- ############################
       exposure={
       current=3,
       count=7,
       },
       
       -- ############################
       -- # 白平衡
       -- # 0		自动
       -- # 1		晴天
       -- # 2		阴天
       -- # 3		白炽光
       -- # 4		荧光
       -- ############################
       whitebalance={
       current=0,
       count=5,
       },
       
       -- ############################
       -- # 光频设置
       -- # 0	50Hz
       -- # 1	60Hz
       -- ############################
       lightfreq={
       current=0,
       count=2,
       },
       
       -- ############################
       -- # 自动屏保
       -- # 0	10s
       -- # 1	30s
       -- # 2	1分钟
       -- # 3	关闭
       -- ############################
       autoscreensaver={
       current=3,
       count=4,
       },
       
       
       -- ############################
       -- # 延时关机
       -- # 0	关闭
       -- # 1	3分钟
       -- # 2	5分钟
       -- # 3	10分钟
       -- ############################
       timedshutdown={
       current=0,
       count=4,
       },
       
       -- ############################
       -- # wifi信息
       -- # 0  ssid	
       -- # 1	密码
       -- ############################
       wifiinfo={
       ssid="awcdr",
       password="12345678",
       },
       
      },
--- ########### camera config end  ################

--- ########### device config start  ################
device={

         -- ############################
         -- # 语言
         -- # 0		中文简体
         -- # 1		英文
         -- ############################
         language={
         current=0,
         count=12,
         },
         -- ############################
         -- # 设备时间 //滴滴项目只有刷新网络时间，没有手动调整，所以这里改为1个，同时语言那里的字符串也要删除手动调整。C30添加为2项即可
         -- # 0		刷新网络时间
         -- # 1		手动调整时间
         -- ############################
         updatetime={
         current=0,
         count=1,
         },
         -- ############################
         -- # 声音音量调节
         -- # 0	    关闭
         -- # 1	    30%
         -- # 2	    50%
         -- # 3	    80%
         -- # 4	    100%
         -- ############################
         voicestatus={
         current=4,
         count=5,
         },
		 ---------
		 gpsswitch={
         current=0,
         count=2,
         },
		 ---------
		 speedunit={
         current=0,
         count=2,
         },
		 timezone={
         current=8,
         count=24,
         },
         -- ############################
         -- # 系统版本号
         -- ############################
         sysversion={
			version="TF700-20191101a-7P025a-09091",
         },
		 -- ############################
         -- #如果设置菜单改动很大，希望暴力直接覆盖
		 -- #用户之前的信息data/menu_config.lua，就
		 -- #可以update= "true"所以不要轻易修改这个
		 -- #配置的为true
         -- #############################
		 updatemenu={
			update="false",
         },
		 systemTimeSave={
			timeStr="2019-10-01 00:00:00",
         },
		 carid={
			idstr="AB123456",
         },
        },
--- ########### device config end  ################
}

